# Написать свой модуль utils и перенести в него функцию currency_rates()
# из предыдущего задания. Создать скрипт, в котором импортировать этот модуль
# и выполнить несколько вызовов функции currency_rates().
# Убедиться, что ничего лишнего не происходит.

import DZ_4_4_NMaz_def
print(DZ_4_4_NMaz_def.currency_rate("EUR"))

